In [14]:
import pandas as pd

In [13]:
df = pd.read_excel("Excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [4]:
df[df.duplicated()]

   ID   Name   Age Profession  salary
4   4  Rocky  56.0       Chef  117920
5   4  Rocky  56.0       Chef  117920
6   4  Rocky  56.0       Chef  117920
7   4  Rocky  56.0       Chef  117920
8   4  Rocky  56.0       Chef  117920
9   4  Rocky  56.0       Chef  117920

In [5]:
df[df.duplicated(subset = ["Age","Profession"])]

      ID      Name   Age         Profession  salary
4      4     Rocky  56.0               Chef  117920
5      4     Rocky  56.0               Chef  117920
6      4     Rocky  56.0               Chef  117920
7      4     Rocky  56.0               Chef  117920
8      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
493  494    Sophia  39.0             Doctor  174500
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[217 rows x 5 columns]

In [6]:
df[df.duplicated(subset = ["Age", "Profession", "salary"])]

    ID      Name   Age Profession  salary
4    4     Rocky  56.0       Chef  117920
5    4     Rocky  56.0       Chef  117920
6    4     Rocky  56.0       Chef  117920
7    4     Rocky  56.0       Chef  117920
8    4     Rocky  56.0       Chef  117920
9    4     Rocky  56.0       Chef  117920
20  21  Sherlock  40.0  Detective  118998
22  23      John  41.0  Scientist  175925
29  30     Alice  21.0       Chef   84792

In [7]:
df3 = df.copy()
df3 = df3.drop_duplicates(subset = ["Age", "Profession", "salary"])

In [8]:
df3[df3.duplicated()]

Empty DataFrame
Columns: [ID, Name, Age, Profession, salary]
Index: []

In [10]:
df3.shape

(491, 5)